;; -*- no-byte-compile: t; -*-
;;; .config/doom/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! academic-phrases)
(package! aggressive-indent)
(package! alert)
(package! all-the-icons)
(package! all-the-icons-ivy)
(package! atomic-chrome)
(package! carbon-now-sh)
(package! company-quickhelp)
(package! counsel-dash :disable t)
(package! deadgrep)
(package! eglot :disable t)
(package! electric-operator)
(package! evil-mc)
(package! evil-vimish-fold)
(package! exec-path-from-shell)
(package! focus)
(package! glsl-mode)
(package! graphql-mode)
(package! highlight-indent-guides :disable t)
(package! indium)
(package! json-snatcher)
(package! key-chord)
(package! magithub)
(package! magit-todos)
(package! olivetti)
(package! openwith)
(package! pipenv)
(package! poly-R)
(package! poly-markdown)
(package! polymode)
(package! prettier-js)
(package! request)
(package! tramp)
(package! vimish-fold)
(package! vimrc-mode)
(package! writegood-mode)
(package! ws-butler)
(package! xcscope)
